Repository: romanzes637/gmsh_scripts
Catalog: docs/locale/*/LC_MESSAGES/tutorial_section_2.po
Languages: fr, ru

source: Cross section 2
fr: Section transversale 2
ru: Поперечное сечение 2

source: Let's consider a cross section (See `examples/matrix/cross_section_2`_)
ru: Давайте рассмотрим поперечное сечение (смотрите `examples/matrix/cross_section_2`_)

source: Cross section
fr: Section transversale
ru: Поперечное сечение

source: We can use :py:class:`~gmsh_scripts.block.matrix.Matrix` class to create this type of geometry. First we need to decompose geometry into blocks and then modify each of them according to the dimensions.
fr: Nous pouvons utiliser la classe :py:class:`~gmsh_scripts.block.matrix.Matrix` pour créer ce type de géométrie. Nous devons d'abord décomposer la géométrie en blocs, puis modifier chacun d'eux en fonction des dimensions.
ru: Для создания этого типа геометрии мы будем использовать класс :py:class:`~gmsh_scripts.block.matrix.Matrix`. Первым делом нам нужно деомпозировать геометрию на блоки и затем модифицировать каждый из них в соответствии с размерами.

source: Decomposition
fr: Décomposition
ru: Декомпозиция

source: Geometry could be decomposed into 4 blocks: ``BOTTOM``, ``TOP1``, ``TOP2`` and ``TOP3``, where ``TOP3`` part is required for a small surface with :math:`F`, :math:`u_v` boundary condition at the end of the upper part of the geometry. Without the boundary condition, 3 blocks would be enough. Each of these blocks will be described by :py:class:`~gmsh_scripts.block.matrix.Matrix` class.
fr: La géométrie peut être décomposée en 4 blocs: ``BOTTOM``, ``TOP1``, ``TOP2`` et "``TOP3``, où la partie ``TOP3`` est requise pour une petite surface avec :math:`F`, :math:`u_v` condition aux limites à la fin de la partie supérieure de la géométrie. Sans la condition aux limites, 3 blocs suffiraient. Chacun de ces blocs sera décrit par la classe :py:class:`~gmsh_scripts.block.matrix.Matrix`.
ru: Геометрию можно разбить на 4 блока: ``BOTTOM``, ``TOP1``, ``TOP2`` и ``TOP3``, где часть ``TOP3`` требуется для небольшой поверхности с граничным условием :math:`F`, :math:`u_v` на конце верхней части. Без граничного условия, трех блоков было бы достаточно. Каждый из этих блоков будет описан классом:py:class:`~gmsh_scripts.block.matrix.Matrix`.

source: Decomposition of geometry
fr: Décomposition de la géométrie
ru: Декомпозиция геометрии

source: Geometry
fr: Géométrie
ru: Геометрия

source: Let's define that X-axis is directed to the right, Y - in the depth and Z - upward, i.e cross section is symmetric along Y-axis.
fr: Définissons que l'axe X est dirigé vers la droite, Y - dans la profondeur et Z - vers le haut, c'est-à-dire que la section transversale est symétrique le long de l'axe Y.
ru: Определим, что ось X направлена вправо, Y - в глубину, а Z - вверх, т.е. поперечное сечение симметрично относительно оси Y.

source: First we should create a separate file for each of the blocks:
fr: Nous devons d'abord créer un fichier séparé pour chacun des blocs:
ru: Сначала мы должны создать отдельный файл для каждого из блоков:

source: Each of the files consists of one high level field ``data`` whose has 2 fields: 1. ``class`` - name of the class of the block 2. ``matrix`` - lists of point coordinates by axes
fr: Chacun des fichiers est constitué d'un champ de haut niveau ``data`` dont 2 champs: 1. ``class`` - nom de la classe du bloc 2. ``matrix`` - listes de coordonnées de points par axes
ru: Каждый из файлов состоит из одного поля высокого уровня ``data``, которое имеет 2 поля: 1. ``class`` - название класса блока 2. ``matrix`` - списки координат точек по осям

source: For example Matrix has 2 points by X-axis with coordinates ``0`` and ``0.250``.
fr: Par exemple Matrix a 2 points par axe X avec les coordonnées ``0`` et ``0.250``.
ru: Например, Matrix имеет 2 точки по оси X с координатами ``0`` и ``0.250``.

source: Matrix also has 2 points by Y-axis with ``0`` and ``1`` coordinates and 2 points by Z-axis with ``0`` and ``0.250``. Thus Matrix is a box with dimensions: ``0.250``, ``1`` and ``0.250`` by X, Y and Z axis respectively and origin at point ``(0, 0, 0)``.
fr: La matrice a également 2 points par axe Y avec les coordonnées ``0`` et ``1`` et 2 points par axe Z avec ``0`` et ``0.250``. Ainsi Matrix est une boîte de dimensions : ``0.250``, ``1`` et ``0.250`` par les axes X, Y et Z respectivement et l'origine au point ``(0, 0, 0)``.
ru: Матрица также имеет 2 точки по оси Y с координатами ``0`` и ``1`` и 2 по оси Z с ``0`` и ``0,250``. Таким образом, Матрица представляет собой с параллелограмм с размерами: ``0,250``, ``1`` и ``0,250`` по осям X, Y и Z соответственно и начало в точке ``(0, 0, 0)``"

source: We could generate geometry of ``bottom.yaml`` into ``bottom.geo_unrolled`` file:
fr: Nous pourrions générer la géométrie de ``bottom.yaml`` dans le fichier ``bottom.geo_unrolled``:
ru: Мы можем сгенерировать геометрию ``bottom.yaml`` в файле ``bottom.geo_unrolled``:

source: Geometry of the the ``BOTTOM`` block
fr: Géométrie du bloc ``BOTTOM``
ru: Геометрия блока ``BOTTOM``

source: Now we should create main file ``main.yaml`` with all blocks:
fr: Nous devons maintenant créer le fichier principal ``main.yaml`` avec tous les blocs:
ru: Теперь нам нужно создать основной файл ``main.yaml`` со всеми блоками:

source: File also has one high level field ``data`` with 4 sub-fields:
fr: Le fichier a également un champ de haut niveau ``data`` avec 4 sous-champs:
ru: Файл также имеет одно поле высокого уровня «data» с 4 подполями:

source: ``class`` - name of the class of the block
fr: ``class`` - nom de la classe du bloc
ru: ``class`` - имя класса блока

source: ``do_register`` - create this block? (set 0 because we don't need this block itself, i.e. it's only a container for other blocks)
fr: ``do_register`` - créer ce bloc? (mettez 0 car nous n'en avons pas besoinbloquer lui-même, c'est-à-dire que ce n'est qu'un conteneur pour d'autres blocs)
ru: ``do_register`` - Нужно ли создавать блок? (установлено 0, потому что нам не нужно создавать сам блок, т.е. это только контейнер для других блоков)

source: ``children`` - references to other block files (should start with ``/`` character)
fr: ``children`` - références à d'autres fichiers de blocs (doit commencer par le
ru: ``children`` - ссылки на другие блочные файлы (должны начинаться с символа ``/``

source: ``children_transforms`` - transforms of other blocks
fr: ``children_transforms`` - transformations d'autres blocs
ru: ``children_transforms`` - трансформации блоков

source: Field ``children_transforms`` is a list of :py:class:`~gmsh_scripts.transform.transform.Transform` for each ``children``. In this tutorial we only need simple :py:class:`~gmsh_scripts.transform.transform.Translate` that are given by 3 numbers - offset along X, Y ans Z axes respectively.
fr: Le champ ``children_transforms`` est une liste de :py:class:`~gmsh_scripts.transform.transform.Transform` pour chaque ``enfants``. Dans ce tutoriel, nous n'avons besoin que de :py:class:`~gmsh_scripts.transform.transform.Translate` qui sont donnés par 3 nombres - décalés le long des axes X, Y et Z respectivement.
ru: Поле ``children_transforms`` представляет собой список :py:class:`~gmsh_scripts.transform.transform.Transform` для каждого ``children``. В этом примере нам нужны только простые :py:class:`~gmsh_scripts.transform.transform.Translate`, описываемые 3 числами - смещение по осям X, Y и Z соответственно.

source: For example:
fr: Par example:
ru: Например:

source: Child ``bottom.yaml`` has no transforms
fr: L'enfant ``bottom.yaml`` n'a pas de transformations
ru: Дочерний элемент ``bottom.yaml`` не имеет трансформаций

source: Child ``top_1.yaml`` has one :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0, 0, 0.250 ]`` with offset 0.250 by Z-axis and no offsets by X and Y (we just need to elevate to the ``bottom.yaml``)
fr: L'enfant ``top_1.yaml`` en a un :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0, 0, 0.250 ]`` avec un décalage de 0.250 par l'axe Z et aucun décalage par X et Y (nous avons juste besoin de pour élever au ``bottom.yaml``)
ru: Дочерний элемент ``top_1.yaml`` имеет одну :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0, 0, 0,250 ]`` со смещением 0,250 по оси Z и без смещений по X и Y (нам просто нужно поднять его на ``bottom.yaml``)

source: Child ``top_2.yaml`` has one :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0.250, 0, 0.250 ]``
fr: L'enfant ``top_2.yaml`` en a un :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0.250, 0, 0.250 ]``
ru: Дочерний элемент ``top_2.yaml`` имеет одну :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0.250, 0, 0,250 ]``

source: Child ``top_3.yaml`` has one :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0.470, 0, 0.250 ]``
fr: L'enfant ``top_3.yaml`` en a un :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0.470, 0, 0.250 ]``
ru: Дочерний элемент ``top_3.yaml`` имеет одну :py:class:`~gmsh_scripts.transform.transform.Translate` ``[ 0.470, 0, 0,250 ]``

source: Let's generate geometry with all blocks into ``main.geo_unrolled``:
ru: Сгенерируем геометрию со всеми блоками в ``main.geo_unrolled``:

source: Geometry with all blocks
fr: Géométrie avec tous les blocs
ru: Геометрия со всеми блоками

source: Mesh
fr: Maille
ru: Сетка

source: To generate mesh we should add ``metadata`` field to the ``main.yaml`` file:
fr: Pour générer un maillage, nous devons ajouter le champ ``metadata`` au fichier ``main.yaml``:
ru: Чтобы сгенерировать сетку, мы должны добавить поле ``metadata`` в ``main.yaml`` файл:

source: ``factory`` - Which kernel of gmsh to use for mesh generation? Currently, gmsh has two `kernels <https://gmsh.info/doc/texinfo/gmsh.html#Overview-of-Gmsh>`_: ``geo`` and ``occ``. We use ``geo`` because it's faster
fr: ``factory`` - Quel noyau de gmsh utiliser pour la génération de maillage? Actuellement, gmsh a deux ``geo`` et ``occ``. Nous utilisons ``geo`` parce que c'est plus rapide
ru: ``factory`` - Какое ядро gmsh использовать для генерации сетки? В настоящее время,gmsh имеет два ядра <https://gmsh.info/doc/texinfo/gmsh.html#Overview-of-Gmsh>`_: ``geo`` и ``occ``. Мы используем ``geo``, потому что он быстрее

source: ``strategy`` - :py:class:`~gmsh_scripts.strategy.strategy.Strategy` of mesh generation
fr: ``strategy`` - :py:class:`~gmsh_scripts.strategy.strategy.Strategy` de génération de maillage
ru: ``strategy`` - :py:class:`~gmsh_scripts.strategy.strategy.Strategy` генерация сетки

source: ``strategy.class`` - Class of the strategy. We use :py:class:`~gmsh_scripts.strategy.strategy.NoBoolean` because we don't need boolean operations
fr: ``strategy.class`` - Classe de la stratégie. Nous utilisons :py:class:`~gmsh_scripts.strategy.strategy.NoBoolean` car nous n'avons pas besoin d'opérations booléennes
ru: ``strategy.class`` - Класс стратегии. Используем :py:class:`~gmsh_scripts.strategy.strategy.NoBoolean`, потому что нам не нужны булевы операции

source: If we need boolean operations we MUST use ``occ`` factory with default strategy (just don't set it in the ``metadata``)
fr: Si nous avons besoin d'opérations booléennes, nous DEVONS utiliser la fabrique ``occ`` avec la stratégie par défaut (ne la définissez pas dans les ``metadata``)
ru: Если нам нужны булевы операции, мы ДОЛЖНЫ использовать фабрику ``occ`` со стратегией по умолчанию (просто не устанавливайте ее в ``metadata``)

source: Now mesh generator will return mesh into ``main.msh2`` file (it also returns ``main.geo_unrolled`` as before). Generator creates unstructured tetrahedral mesh by default.
fr: Maintenant, le générateur de maillage renverra le maillage dans le fichier ``main.msh2`` (il renvoie également ``main.geo_unrolled`` comme auparavant). Le générateur crée un maillage tétraédrique non structuré par défaut.
ru: Теперь генератор сетки будет возвращать сетку в файл ``main.msh2`` (он также возвращает ``main.geo_unrolled`` как и раньше). Генератор создает неструктурированную тетраэдральную сетку по умолчанию.

source: Default mesh
fr: Maillage par défaut
ru: Сетка по умолчанию

source: Unstructured Tetrahedral
fr: Tétraédrique non structuré
ru: Неструктурированная Тетраэдральная

source: We can customize unstructured mesh with parameters in input files.
fr: Nous pouvons personnaliser le maillage non structuré avec des paramètres dans les fichiers d'entrée.
ru: Мы можем настроить неструктурированную сетку параметрами во входных файлах.

source: First type of parameters aka ``points parameters`` is set in ``matrix`` field (e.g. ``bottom.yaml``):
ru: Первый тип параметров ``points parameters``, задается в ``matrix`` поле (например, ``bottom.yaml``):

source: As one can see, for each point a new parameter have been added with ``;`` separator, e.g. ``0;0.01`` for first point by X-axis or ``0.250;0.1`` for second point by Z-axis. Parameters ``0.01`` or ``0.1`` are approximate sizes of the mesh near the corresponding points.
fr: Comme on peut le voir, pour chaque point un nouveau paramètre a été ajouté avec le séparateur ``;``, par ex. ``0;0.01`` pour le premier point par l'axe X ou ``0.250;0.1`` pour le deuxième point par l'axe Z. Les paramètres ``0.01`` ou ``0.1`` sont des tailles approximatives du maillage près des points correspondants.
ru: Как видно, для каждой точки добавлен новый параметр с разделителем ``;``, например ``0;0.01`` для первой точки по оси X или ``0.250;0.1`` для второй точки по оси Z. Параметры ``0.01`` или ``0.1`` равны приблизительным размеры сетки вблизи соответствующих точек

source: In this example, mesh is finer near the ``(0, 0, 0)`` point with size ``0.01`` and coarser near the ``(0.250, 1, 0.250)`` point with size ``0.1``.
fr: Dans cet exemple, le maillage est plus fin près du point ``(0, 0, 0)`` avec une taille ``0.01`` et plus grossier près du point ``(0.250, 1, 0.250)`` avec une taille ``0.1``.
ru: В этом примере сетка более мелкая вблизи точки ``(0, 0, 0)`` с размером ``0,01`` и грубее возле точки ``(0,250, 1, 0,250)`` с размером ``0,1``.

source: Let's add ``metadata`` field to ``bottom.yaml`` and generate mesh:
fr: Ajoutons le champ ``metadata`` à ``bottom.yaml`` et générons le maillage:
ru: Давайте добавим поле ``metadata`` в ``bottom.yaml`` и создадим сетку:

source: Unstructured tetrahedral mesh of the ``BOTTOM`` block
fr: Maillage tétraédrique non structuré du bloc ``BOTTOM``
ru: Неструктурированная тетраэдральная сетка блока ``BOTTOM``

source: One could fix mesh size along one of the axis (e.g. Y with ``0.01``):
fr: On pourrait fixer la taille du maillage le long d'un des axes (par exemple Y avec ``0.01``):
ru: Можно зафиксировать размер сетки вдоль одной из осей (например, Y с «0,01»):

source: Unstructured tetrahedral mesh with fixed size along Y-axis of the ``BOTTOM`` block
fr: Maillage tétraédrique non structuré de taille fixe le long de l'axe Y du bloc ``BOTTOM``"
ru: Неструктурированная тетраэдральная сетка с фиксированным размером по оси Y блока ``BOTTOM``

source: To generate all blocks, one needs to specify points parameters at all blocks and run generator:
ru: Чтобы сгенерировать все блоки, нужно указать ``points parameters`` для всех блоков и запускает генератор:

source: Unstructured tetrahedral mesh with fixed size along Y-axis at ``BOTTOM`` block
fr: Maillage tétraédrique non structuré avec une taille fixe le long de l'axe Y au bloc ``BOTTOM``
ru: Неструктурированная тетраэдральная сетка с фиксированным размером вдоль оси Y в ``BOTTOM`` блоке

source: Second type of parameters aka ``global parameters`` is set in ``metadata.run.options`` field (e.g. ``bottom.yaml``):
fr: Le deuxième type de paramètres alias ``global parameters`` est défini dans le champ ``metadata.run.options`` (par exemple, ``bottom.yaml``):
ru: Второй тип параметров ``global parameters``, задается в поле ``metadata.run.options`` (например, ``bottom.yaml``):

source: Here are 4 options (many other options available, see `gmsh documentation <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_): 1. ``Mesh.MeshSizeFactor`` - factor applied to all mesh element sizes 2. ``Mesh.MeshSizeMin`` - minimum mesh element size 3. ``Mesh.MeshSizeMax`` - maximum mesh element size 4. ``Mesh.MeshSizeFromPoints`` - compute mesh element sizes from values given at geometry points (e.g. in ``matrix`` field)
fr: Voici 4 options (de nombreuses autres options disponibles, voir `documentation gmsh <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_): 1. ``Mesh.MeshSizeFactor`` - facteur appliqué à toutes les tailles d'éléments de maillage 2. ``Mesh.MeshSizeMin`` - taille minimale des éléments de maillage 3. ``Mesh.MeshSizeMax`` - taille maximale des éléments de maillage 4. ``Mesh.MeshSizeFromPoints`` - calcule les tailles des éléments de maillage à partir de valeurs données aux points géométriques (par exemple dans le champ ``matrix``)
ru: `документацию по gmsh <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_): 1. ``Mesh.MeshSizeFactor`` - коэффициент, применяемый ко всем размерам элемента сетки 2. ``Mesh.MeshSizeMin`` - минимальный размер элемента сетки 3. ``Mesh.MeshSizeMax`` - максимальный размер элемента сетки 4. ``Mesh.MeshSizeFromPoints`` - взять размеры элементов из значений, заданных в точках геометрии (например, в ``matrix`` поле)

source: In this example ``Mesh.MeshSizeFactor`` is set to ``0.5`` that generate mesh that is twice as fine.
fr: Dans cet exemple, ``Mesh.MeshSizeFactor`` est défini sur ``0.5``, ce qui génère un maillage deux fois plus fin.
ru: В этом примере для ``Mesh.MeshSizeFactor`` установлено значение ``0,5``, что создает сетку, которая в два раза мельче»

source: Unstructured tetrahedral mesh with ``Mesh.MeshSizeFactor = 0.5``
fr: Maillage tétraédrique non structuré avec ``Mesh.MeshSizeFactor = 0.5``
ru: Неструктурированная тетраэдральная сетка с ``Mesh.MeshSizeFactor = 0.5``

source: One could disable ``Mesh.MeshSizeFromPoints`` (set to ``0``) to create uniform mesh whose size is controlled only by ``global parameters``.
fr: On pourrait désactiver ``Mesh.MeshSizeFromPoints`` (réglé sur ``0``) pour créer un maillage uniforme dont la taille n'est contrôlée que par ``global parameters``.
ru: Можно отключить ``Mesh.MeshSizeFromPoints`` (установить значение ``0``), чтобы создать равномерную сетку, размер которой контролируется только ``global parameters``.

source: Unstructured tetrahedral mesh with ``Mesh.MeshSizeFromPoints = 0``
fr: Maillage tétraédrique non structuré avec ``Mesh.MeshSizeFromPoints = 0``
ru: Неструктурированная тетраэдральная сетка с ``Mesh.MeshSizeFromPoints = 0``

source: Then we could use to control mesh size, e.g with ``Mesh.MeshSizeMax`` = ``0.1``:
fr: Ensuite, nous pourrions utiliser pour contrôler la taille du maillage, par exemple avec ``Mesh.MeshSizeMax`` = ``0.1``:
ru: Тогда мы могли бы использовать ``global parameters`` для управления размером сетки, например, с помощью ``Mesh.MeshSizeMax`` = ``0,1``:

source: Unstructured mesh with ``Mesh.MeshSizeMax = 0.1``
fr: Maillage non structuré avec ``Mesh.MeshSizeMax = 0.1``
ru: Неструктурированная сетка с ``Mesh.MeshSizeMax = 0.1``

source: To generate all blocks, one needs to specify ``global parameters`` in ``main.yaml``:
fr: Pour générer tous les blocs, il faut spécifier des ``global parameters`` dans ``main.yaml`` :
ru: Для генерации всех блоков необходимо указать ``global parameters`` в ``main.yaml``:

source: Unstructured tetrahedral mesh controlled by ``global parameters``
fr: Maillage tétraédrique non structuré contrôlé par ``global parameters``
ru: Неструктурированная тетраэдральная сетка, управляемая ``global parameters``

source: Unstructured Hexahedral
fr: Hexaèdre non structuré
ru: Неструктурированная Гексаэдральная

source: Generation of hexahedral unstructured mesh is `experimental <https://gitlab.onelab.info/gmsh/gmsh/-/issues/1791>`_ so not always creates a quality mesh, it depends on the complexity of the geometry.
fr: La génération de maillage hexaédrique non structuré est `expérimentale <https://gitlab.onelab.info/gmsh/gmsh/-/issues/1791>`_ donc ne crée pas toujours un maillage de qualité, cela dépend de la complexité de la géométrie.
ru: Генерация гексаэдральной неструктурированной сетки является ` экспериментальной <https://gitlab.onelab.info/gmsh/gmsh/-/issues/1791>`_ так что не всегда создает качественную сетку, это зависит от сложности геометрии.

source: Unstructured hexahedral parameters are set in ``metadata.run.options`` field and have ``Recombine`` in their names (see `gmsh options <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_)
fr: Les paramètres hexaédriques non structurés sont définis dans le champ ``metadata.run.options`` et ont ``Recombine`` dans leurs noms (voir `options gmsh <https://gmsh.info/doc/texinfo/gmsh.html#Mesh- choix>`_)
ru: Параметры для неструктурированные гексадральной сетки задаются в ``metadata.run.options`` и должны иметь ``Recombine`` в своих названиях (см. `опции gmsh <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_)

source: To generate unstructured hexahedral mesh parameter ```Mesh.SubdivisionAlgorithm`` should be set greater than ``1`` (see `tutorial 11 of gmsh <https://gmsh.info/doc/texinfo/gmsh.html#t11>`_ for more information)
fr: Pour générer un maillage hexaédrique non structuré, le paramètre ```Mesh.SubdivisionAlgorithm`` doit être supérieur à ``1`` (voir `tutoriel 11 de gmsh <https://gmsh.info/doc/texinfo/gmsh.html#t11>`_ pour plus d'informations)
ru: Для создания неструктурированной гексаэдральной сетки, параметр ```Mesh.SubdivisionAlgorithm`` должен быть больше, чем ``1`` (см. `пример 11 по gmsh <https://gmsh.info/doc/texinfo/gmsh.html#t11>`_ для дополнительной информации)

source: Unstructured hexahedral mesh of ``bottom.yaml``
ru: Неструктурированная гексаэдральная сетка ``bottom.yaml``

source: To generate unstructured hexahedral mesh of all blocks add parameters to ``metadata`` of ``main.yaml``:
fr: Pour générer un maillage hexaédrique non structuré de tous les blocs, ajoutez des paramètres aux ``metadata`` de ``main.yaml``:
ru: Для создания неструктурированной гексаэдральной сетки из всех блоков добавьтпараметры в ``metadata`` ``main.yaml``:

source: Unstructured hexahedral mesh
fr: Maillage hexaédrique non structuré
ru: Неструктурированная гексаэдральная сетка

source: Structured Tetrahedral
fr: Tétraédrique Structuré
ru: Структурированная тетраэдральная

source: To create structured tetrahedral mesh one should add third parameter to the points at ``matrix`` field with ``;`` separator, e.g. in ``bottom.yaml``:
fr: Pour créer un maillage tétraédrique structuré, il faut ajouter un troisième paramètre aux points du champ ``matrix`` avec le séparateur ``;``, par ex. dans ``bottom.yaml``:
ru: Для создания структурированной тетраэдральной сетки необходимо добавить третий параметр к точки в поле ``matrix`` с разделителем ``;``, например, в ``bottom.yaml``:

source: Third argument should be set only for second point and specifies number of nodes along corresponding direction. E.g. ``4`` nodes by X-axis, ``8`` nodes by Y and ``16`` by Z.
fr: Le troisième argument doit être défini uniquement pour le deuxième point et spécifie le nombre de nœuds dans la direction correspondante. Par exemple, ``4`` nœuds par l'axe X, ``8`` nœuds par Y et ``16`` par Z.
ru: Третий аргумент должен быть установлен только для второй точки и указывает число узлов вдоль соответствующего направления. Например, ``4`` узлов по оси X, ``8``узлы по Y и ``16`` по Z.

source: Structured tetrahedral mesh of the ``BOTTOM`` block
fr: Maillage tétraédrique structuré du bloc ``BOTTOM``
ru: Структурированная тетраэдральная сетка блока ``BOTTOM``
