Repository: romanzes637/gmsh_scripts
Catalog: docs/locale/*/LC_MESSAGES/tutorial_simple_layer.po
Languages: fr, ru

source: Simple Layer
ru: Простой Layer

source: Concept
ru: Концепция

source: Class :py:class:`~gmsh_scripts.block.layer.Layer` is a successor of class :py:class:`~gmsh_scripts.block.matrix.Matrix`, which is a collection of :py:class:`~gmsh_scripts.block.block.Block` in a structure of 3D regular grid.
fr: La classe :py:class:`~gmsh_scripts.block.layer.Layer` est un successeur de la classe :py:class:`~gmsh_scripts.block.matrix.Matrix`, qui est une collection de :py:class:`~gmsh_scripts.block.block.Block` dans une structure de grille régulière 3D.
ru: Класс :py:class:`~gmsh_scripts.block.layer.Layer` наследник класса :py:class:`~gmsh_scripts.block.matrix.Matrix`, который является коллекцией :py:class:`~gmsh_scripts.block.block.Block` с 3D регулярной сеточной структурой

source: Class :py:class:`~gmsh_scripts.block.layer.Layer` removes :py:class:`~gmsh_scripts.block.block.Block` from :py:class:`~gmsh_scripts.block.matrix.Matrix` that do not have 0 coordinate by X or Y axes and applies transformations to remaining blocks :py:class:`~gmsh_scripts.block.block.Block` that are connect their sides.
fr: La classe :py:class:`~gmsh_scripts.block.layer.Layer` supprime :py:class:`~gmsh_scripts.block.block.Block` de :py:class:`~gmsh_scripts.block.matrix.Matrix` qui ne pas avoir la coordonnée 0 par les axes X ou Y et applique les transformations aux blocs restants :py:class:`~gmsh_scripts.block.block.Block` qui sont connectés par leurs côtés.
ru: Класс :py:class:`~gmsh_scripts.block.layer.Layer` убирает :py:class:`~gmsh_scripts.block.block.Block` из :py:class:`~gmsh_scripts.block.matrix.Matrix` которые имеют ненулевую кооридинату по X и Y осям и производит трансформации к оставшимся блокам :py:class:`~gmsh_scripts.block.block.Block` соединяя их стороны.

source: Filtered Matrix
fr: Matrix filtrée
ru: Отфильтрованная Matrix

source: We can change type of surfaces by X and Y axes to curved ones. Number of nodes by circumferential direction is determined by last number ``0.5;;8`` at first radial ``layer``:
fr: Nous pouvons changer le type de surfaces par les axes X et Y en courbes. Le nombre de nœuds par direction circonférentielle est déterminé par le dernier nombre ``0.5;;8`` à la première ``couche`` radiale:
ru: Мы можем поменять тип поверхностей по X и Y осям на криволинейный. Количество узлов по окружности определяется последним номером ``0.5;;8`` в первом радиальном ``layer``:

source: Curved Layer
fr: Layer incurvé
ru: Криволинейный Layer

source: One can also change number of nodes by radial/height layer changing last number of subfields of first/second ``layer``:
fr: On peut également modifier le nombre de nœuds par couche radiale/hauteur en modifiant le dernier nombre de sous-champs de la première/seconde ``layer``:
ru: Также можно изменить количество узлов по радиальному/высотному слою, изменив последнее число подполей первого/второго ``layer``

source: Layer with different number of nodes by radial/height layers
fr: Layer avec un nombre différent de nœuds par couches radiales/hauteur
ru: Layer с разным количеством узлов по радиальным/высотным слоям

source: Number of layers
fr: Nombre de layers
ru: Количество слоев

source: One can add radial layers by appending additional items in the first ``layer`` subfield:
fr: On peut ajouter des couches radiales en ajoutant des éléments supplémentaires dans le premier sous-champ ``layer``:
ru: Можно добавить радиальные слои, добавив дополнительные элементы в первое подполе ``layer``:

source: Multi Layer
ru: Несколько Слоев

source: One can add height layers by appending additional items in the second ``layer`` subfield:
fr: On peut ajouter des couches de hauteur en ajoutant des éléments supplémentaires dans le deuxième sous-champ ``layer``:
ru: Можно добавить уровни высоты, добавив дополнительные элементы во второе подполе ``layer``:

source: Multi Height Layer
fr: Layer multi-hauteur
ru: Layer с несколькими высотами

source: Zones
ru: Зоны

source: To specify zones one needs add ``items_zones`` and ``items_zones_map`` fields. Where ``items_zones`` is a list of pairs of volume and six surfaces names, e.g. ``[ Volume, [ NX, X, NY, Y, NZ, Z ] ]``:
fr: Pour spécifier des zones, il faut ajouter les champs ``items_zones`` et ``items_zones_map``. Où ``items_zones`` est une liste de paires de noms de volume et de six surfaces, par ex. ``[ Volume, [ NX, X, NY, Y, NZ, Z ] ]``:
ru: Для указания зон необходимо добавить поля ``items_zones`` и ``items_zones_map``. Где ``items_zones`` - это список пар имен объемов и шести поверхностей, например. ``[ Volume, [ NX, X, NY, Y, NZ, Z ] ]``:

source: ``Volume`` - volume name
fr: ``Volume`` - nom du volume
ru: ``Volume`` - имя объема

source: ``[ NX, X, NY, Y, NZ, Z ]`` - surfaces names:
fr: ``[ NX, X, NY, Y, NZ, Z ]`` - noms des surfaces:
ru: ``[ NX, X, NY, Y, NZ, Z ]`` - имена поверхностей:

source: ``NX`` - surface pointing in the opposite direction of X-axis
fr: ``NX`` - surface pointant dans la direction opposée à l'axe X
ru: ``NX`` - поверхность, направленная в направлении, противоположном оси X

source: ``X`` - surface pointing in the direction of X-axis
fr: ``X`` - surface pointant dans la direction de l'axe X
ru: ``X`` - поверхность, направленная в направлении оси X

source: ``NY`` - surface pointing in the opposite direction of Y-axis
fr: ``NY`` - surface pointant dans la direction opposée à l'axe Y
ru: ``NY`` - поверхность, направленная в направлении, противоположном оси Y

source: ``Y`` - surface pointing in the direction of Y-axis
fr: ``Y`` - surface pointant dans la direction de l'axe Y
ru: ``Y`` - поверхность, направленная в направлении оси Y

source: ``NZ`` - surface pointing in the opposite direction of Z-axis
fr: ``NZ`` - surface pointant dans la direction opposée à l'axe Z
ru: ``NZ`` - поверхность, направленная в направлении, противоположном оси Z.

source: ``Z`` - surface pointing in the direction of Z-axis
fr: ``Z`` - surface pointant dans la direction de l'axe Z
ru: ``Z`` - поверхность, направленная в направлении оси Z

source: ``items_zones_map`` (and all fields that ends with ``_map``) is an addressing array between items (Blocks in Layer) and corresponding index in some list with properties (e.g. ``items_zones``) and has shape ``number-of-height`` by ``number-of-radial`` layers.
fr: ``items_zones_map`` (et tous les champs qui se terminent par ``_map``) est un tableau d'adressage entre les éléments (blocs dans la couche) et l'index correspondant dans une liste avec des propriétés (par exemple, ``items_zones``) et a la forme `` nombre-de-hauteur`` par ``nombre-de-couches radiales``.
ru: ``items_zones_map`` (и все поля, которые заканчиваются на ``_map``) представляет собой массив адресации между элементами (блоками в слое) и соответствующим индексом в некотором списке со свойствами (например, ``items_zones``) и имеет вид ``кол-во-высотных`` на ``кол-во-радиальных`` слоев.

source: If one want to assign zone names with index ``1`` from ``items_zones`` (``[ B, [ NX_B, X_B, NY_B, Y_B, NZ_B, Z_B ] ]``) to 3th height layer and 5th radial layer one can set ``1`` to ``items_zones_map`` at ``[3, 5]`` location.
fr: Si l'on veut attribuer des noms de zone avec l'indice ``1`` de ``items_zones`` (``[ B, [ NX_B, X_B, NY_B, Y_B, NZ_B, Z_B ] ]``) à la 3ème couche de hauteur et à la 5ème radiale la première couche peut définir ``1`` sur ``items_zones_map`` à l'emplacement ``[3, 5]``.
ru: Если вы хотите присвоить имена зон с индексом ``1`` из ``items_zones`` (``[ B, [ NX_B, X_B, NY_B, Y_B, NZ_B, Z_B ] ]``) до 3-го слоя высоты и 5-го радиального слой можно установить ``1`` в ``items_zones_map`` в ``[3, 5]`` месте.

source: In this example we set:
fr: Dans cet exemple, nous définissons:
ru: В этом примере мы задаем:

source: ``0`` index of ``items_zones`` to middle (3th) height layer by all radial layers except last (5th);
fr: ``0`` index de ``items_zones`` à la couche de hauteur moyenne (3ème) par toutes les couches radiales sauf la dernière (5ème);
ru: ``0`` индекс ``items_zones`` к среднему (3-му) слою высоты по всем радиальным слоям, кроме последнего (5-го);

source: ``1`` index of ``items_zones`` to 2nd and 4th height layer by all radial layers and also last (5th) radial layer in the middle (3th) height layer;
fr: ``1`` index de ``items_zones`` aux 2e et 4e couches de hauteur par toutes les couches radiales et également la dernière (5e) couche radiale dans la couche de hauteur moyenne (3e);
ru: ``1`` индекс ``items_zones`` во 2-й и 4-й слой высоты по всем радиальным слоям, а также последний (5-й) радиальный слой в среднем (3-м) слое высоты;

source: ``2`` index of ``items_zones`` to bottom (1st) and top (5th) height layer by all radial layers.
fr: Indice de ``2`` de ``items_zones`` à la couche de hauteur inférieure (1ère) et supérieure (5e) par toutes les couches radiales.
ru: ``2`` индекс ``items_zones`` к нижнему (1-му) и верхнему (5-му) слою высоты по всем радиальным слоям.

source: Section by X and Y axes of Layer with zones: red - ``0``, green - ``1``, blue - ``2``
fr: Coupe par axes X et Y du Calque avec zones : rouge - ``0``, vert - ``1``, bleu - ``2``
ru: Разрез по осям X и Y слоя с зонами: красная - ``0``, зеленая - ``1``, синяя - ``2``

source: Section by X, Y and Z axes of Layer with zones: red - ``0``, green - ``1``, blue - ``2``
fr: Coupe par axes X, Y et Z du Calque avec zones : rouge - ``0``, vert - ``1``, bleu - ``2``
ru: Разрез по осям X, Y и Z слоя с зонами: красная - ``0``, зеленая - ``1``, синяя - ``2``
