Repository: romanzes637/gmsh_scripts
Catalog: docs/locale/*/LC_MESSAGES/tutorial_simple_children.po
Languages: fr, ru

source: Simple Children
ru: Простой Children

source: Concept
ru: Концепция

source: Each successor of class :py:class:`~gmsh_scripts.block.block.Block` can have children blocks. Each class with ``items`` (currently :py:class:`~gmsh_scripts.block.matrix.Matrix` and :py:class:`~gmsh_scripts.block.layer.Layer`) can have children for each ``item``.
fr: Chaque successeur de la classe :py:class:`~gmsh_scripts.block.block.Block` peut avoir des blocs enfants. Chaque classe avec ``items`` (actuellement :py:class:`~gmsh_scripts.block.matrix.Matrix` et :py:class:`~gmsh_scripts.block.layer.Layer`) peut avoir des enfants pour chaque ``item``.
ru: Каждый преемник класса :py:class:`~gmsh_scripts.block.block.Block` может иметь дочерние блоки. Каждый класс с ``items`` (в настоящее время :py:class:`~gmsh_scripts.block.matrix.Matrix` и :py:class:`~gmsh_scripts.block.layer.Layer`) может иметь дочерние элементы для каждого ``item``.

source: Every child is a gmsh_scripts file in JSON or YAML format.
fr: Chaque enfant est un fichier gmsh_scripts au format JSON ou YAML.
ru: Каждый дочерний элемент представляет собой файл gmsh_scripts в формате JSON или YAML.

source: Children are specified in ``data.children`` field. One could set ``transforms`` for children at ``data.children_transforms`` field.
fr: Les enfants sont spécifiés dans le champ ``data.children``. On pourrait définir ``transforms`` pour les enfants dans le champ ``data.children_transforms``.
ru: Дочерние элементы указываются в поле ``data.children``. Можно установить «преобразования» для детей в поле «data.children_transforms».

source: Items children are specified in ``data.items_children`` One should set ``data.items_children_transforms`` and ``data.items_children_transforms_map`` to apply transformations to them.
fr: Les éléments enfants sont spécifiés dans ``data.items_children`` Il faut définir ``data.items_children_transforms`` et ``data.items_children_transforms_map`` pour leur appliquer des transformations.
ru: Дочерние элементы указаны в ``data.items_children``. Необходимо установить ``data.items_children_transforms`` и ``data.items_children_transforms_map``, чтобы применить к ним преобразования.

source: Children
ru: Дочерние элементы

source: Let's create two children and one parent. Children are instances of class :py:class:`~gmsh_scripts.block.layer.Layer`, i.e. they are cylinders with different radius. Parent is an instance of class :py:class:`~gmsh_scripts.block.block.Block` and has 3 ``items`` arranged along X-axis.
fr: Créons deux enfants et un parent. Les enfants sont des instances de la classe :py:class:`~gmsh_scripts.block.layer.Layer`, c'est-à-dire qu'ils sont des cylindres avec des rayons différents. Le parent est une instance de la classe :py:class:`~gmsh_scripts.block.block.Block` et a 3 ``items`` disposés le long de l'axe X.
ru: Создадим два дочерних элемента и одного родителя. Дети являются экземплярами класса :py:class:`~gmsh_scripts.block.layer.Layer`, т.е. представляют собой цилиндры с разным радиусом. Родитель является экземпляром класса :py:class:`~gmsh_scripts.block.block.Block` и имеет 3 элемента, расположенных по оси X.

source: We create them structured and quadrated for convenience.
fr: Nous les créons structurés et quadrillés pour plus de commodité.
ru: Мы создаем их структурированными и гексагональными для удобства.

source: Child 1
fr: Enfant 1
ru: Дочерний элемент 1

source: Child 2
fr: Enfant 2
ru: Дочерний элемент 2

source: Parent
ru: Родитель

source: One can add children to parent specifying ``data.children`` with list of file names of children started with ``/`` character.
fr: On peut ajouter des enfants au parent en spécifiant ``data.children`` avec la liste des noms de fichiers des enfants commençant par le caractère ``/``.
ru: Можно добавить детей к родителю, указав ``data.children`` со списком имен файлов детей, начинающихся с символа ``/``.

source: Parent with ``children`` without ``children_transforms``
fr: Parent avec ``children`` sans ``children_transforms``
ru: Можно добавить дочерние элементы к родителю, указав ``data.children`` со списком имен файлов дочерних элементов, начинающихся с символа ``/``.

source: As one can see, children are placed in their origin ``(0, 0, 0)``. To move them to another location use ``data.children_transforms`` field that contains ``transforms`` for each children according with their position in ``data.children`` field.
fr: Comme on peut le voir, les enfants sont placés dans leur origine ``(0, 0, 0)``. Pour les déplacer vers un autre emplacement, utilisez le champ ``data.children_transforms`` qui contient ``transforms`` pour chaque enfant en fonction de sa position dans le champ ``data.children``.
ru: Как видите, дочерние элементы помещаются в начало координат ``(0, 0, 0)``. Чтобы переместить их в другое место, используйте поле ``data.children_transforms``, которое содержит ``transforms`` для каждого ребенка в соответствии с их позицией в поле ``data.children``.

source: In this example, we move first child by -1 and second child by 2 along Y-axis.
fr: Dans cet exemple, nous déplaçons le premier enfant de -1 et le deuxième enfant de 2 le long de l'axe Y.
ru: В этом примере мы перемещаем первого потомка на -1, а второго потомка на 2 по оси Y.

source: Parent with ``children`` with ``children_transforms``
fr: Parent avec ``children`` avec ``children_transforms``
ru: Родитель с ``children`` с ``children_transforms``

source: Adding items children is a little trickier: first we need specify children for each item, then apply transformations to each child of each item.
fr: L'ajout d'éléments enfants est un peu plus délicat: nous devons d'abord spécifier des enfants pour chaque élément, puis appliquer des transformations à chaque enfant de chaque élément.
ru: Добавление дочерних элементов немного сложнее: сначала нам нужно указать дочерние элементы для каждого элемента, а затем применить преобразования к каждому дочернему элементу каждого элемента.

source: Working with ``items`` consists of 2 steps: creating ``main field`` with options and then creating ``addressing field``, that ends with ``_map`` suffix with exception of fields with ``do_`` prefix, they don't need ``main field``. Each value in ``addressing field`` is an index in ``main field`` and position of value indicates to which ``item`` of :py:class:`~gmsh_scripts.block.matrix.Matrix` or :py:class:`~gmsh_scripts.block.layer.Layer` should be assigned option from ``main_field``.
fr: Travailler avec ``items`` consiste en 2 étapes: créer un ``main field`` avec des options, puis créer un ``addressing field``, qui se termine par le suffixe ``_map`` à l'exception des champs avec ``do_`` préfixe, ils n'ont pas besoin de ``main field``. Chaque valeur dans le ``addressing field`` est un index dans le ``main field`` et la position de la valeur indique à quel ``item`` de :py:class:`~gmsh_scripts.block.matrix.Matrix` ou :py:class:`~gmsh_scripts.block.layer.Layer` doit se voir attribuer l'option de ``main_field``.
ru: Работа с ``items`` состоит из 2-х шагов: создание ``main field`` с параметрами, а затем создание ``addressing field``, заканчивающегося суффиксом ``_map``, за исключением полей с ``do_`` префикс, им не нужно ``main field``. Каждое значение в ``addressing field`` является индексом в ``addressing field``, а позиция значения указывает, к какому ``item`` :py:class:`~gmsh_scripts.block.matrix.Matrix` или :py :class:`~gmsh_scripts.block.layer.Layer` должна быть назначена опция из ``main_field``.

source: In this example, parent has 3 items, so addressing fields will have length of 3. First we need to define main field for children ``items_children`` then addressing field ``items_children_map``.
fr: Dans cet exemple, le parent a 3 éléments, donc les champs d'adressage auront une longueur de 3. Nous devons d'abord définir le champ principal pour les enfants ``items_children`` puis le champ d'adressage ``items_children_map``.
ru: В этом примере у родителя есть 3 элемента, поэтому поля адресации будут иметь длину 3. Сначала нам нужно определить основное поле для дочерних элементов ``items_children``, а затем поле адресации ``items_children_map``

source: ``items_children`` consists of 3 options, first and second assign one child to an item and third - two:
fr: ``items_children`` se compose de 3 options, la première et la deuxième assignent un enfant à un élément et la troisième - deux:
ru: ``items_children`` состоит из 3 опций, первая и вторая присваивают элементу одного дочернего элемента, а третья - двух:

source: ``/child_1.yaml`` and ``/child_2.yaml``.
fr: ``/child_1.yaml`` et ``/child_2.yaml``.
ru: ``/child_1.yaml`` и ``/child_2.yaml``.

source: ``items_children_map`` assigns first option from ``items_children`` to first item, second option from ``items_children`` to second item, and third to third: ``[0, 1, 2]``.
fr: ``items_children_map`` affecte la première option de ``items_children`` au premier élément, la deuxième option de ``items_children`` au deuxième élément, et la troisième à la troisième: ``[0, 1, 2]``.
ru: ``items_children_map`` присваивает первый параметр из ``items_children`` первому элементу, второй вариант из ``items_children`` второму элементу и третий вариант третьему: ``[0, 1, 2]``.

source: Similarly fields ``items_children_transforms`` and ``items_children_transforms_map`` are set.
fr: De même, les champs ``items_children_transforms`` et ``items_children_transforms_map`` sont définis.
ru: Аналогично задаются поля ``items_children_transforms`` и ``items_children_transforms_map``.

source: ``items_children_transforms`` consists of 2 options, first assign no transforms to one child and third one transform to two children:
fr: ``items_children_transforms`` se compose de 2 options, d'abord n'attribuer aucune transformation à un enfant et la troisième une transformation à deux enfants:
ru: ``items_children_transforms`` состоит из 2 опций, первая не назначает преобразования одному дочернему элементу, а третья – одно преобразование двум дочерним элементам:

source: ``items_children_transforms_map`` assigns first option from ``items_children`` to first and second items and second option to third: ``[0, 0, 1]``.
fr: ``items_children_transforms_map`` attribue la première option de ``items_children`` aux premier et deuxième éléments et la deuxième option au troisième: ``[0, 0, 1]``.
ru: ``items_children_transforms_map`` присваивает первую опцию из ``items_children`` первому и второму элементам, а вторую опцию – третьему: ``[0, 0, 1]``.

source: It's convenient to create only geometry instead of mesh while working with children and their transformations.
fr: Il est pratique de créer uniquement une géométrie au lieu d'un maillage lorsque vous travaillez avec des enfants et leurs transformations.
ru: Удобно создавать только геометрию вместо сетки при работе с дочерними элементами и их трансформациями.

source: Parent with ``items_children`` in ``geo_unrolled`` output format
fr: Parent avec ``items_children`` au format de sortie ``geo_unrolled``
ru: Родитель с ``items_children`` в выходном формате ``geo_unrolled``

source: After that we could add strategy to create the mesh.
fr: Après cela, nous pourrions ajouter une stratégie pour créer le maillage.
ru: После этого мы можем добавить стратегию для создания сетки.

source: Parent with ``items_children``
fr: Parent avec ``items_children``
ru: Родитель с ``items_children``

source: We could supress generation of items (not their children) by setting ``items_do_register_map`` to 0.
fr: Nous pourrions supprimer la génération d'éléments (pas leurs enfants) en définissant ``items_do_register_map`` sur 0.
ru: Мы могли бы подавить создание элементов (не их потомков), установив для ``items_do_register_map`` значение 0.

source: Parent with ``items_children`` without ``items``
fr: Parent avec ``items_children`` sans ``items``
ru: Родитель с ``items_children`` без ``items``

source: We could also create many copies of children inside an item adding additional parameter after coordinate with ``:`` separator, e.g. ``5:4`` divides last item into 3 parts (with 4 nodes) and creates children inside each part.
fr: Nous pourrions également créer de nombreuses copies d'enfants à l'intérieur d'un élément en ajoutant un paramètre supplémentaire après la coordonnée avec le séparateur ``:``, par exemple. ``5:4`` divise le dernier élément en 3 parties (avec 4 nœuds) et crée des enfants à l'intérieur de chaque partie.
ru: Мы также могли бы создать много копий дочерних элементов внутри элемента, добавив дополнительный параметр после координаты с разделителем ``:``, например ``5:4`` делит последний элемент на 3 части (с 4 узлами) и создает дочерние элементы внутри каждой части.

source: Parent with ``items_children`` with extended third item
fr: Parent avec ``items_children`` avec troisième élément étendu
ru: Родитель с ``items_children`` с расширенным третьим элементом

source: All together
fr: Tous ensemble
ru: Все месте

source: One could combine ``children`` and ``items_children``, e.g. to add arbitrarily and regularly located children.
fr: On pourrait combiner ``children`` et ``items_children``, par ex. d'ajouter arbitrairement et régulièrement des enfants localisés.
ru: Можно комбинировать ``children`` и ``items_children``, например. добавлять произвольно и регулярно расположенные дочерние элементы.

source: Parent with ``children`` and ``items_children``
fr: Parent avec ``children`` et ``items_children``
ru: Родитель с ``children`` и ``items_children``

source: Mesh
fr: Maillage
ru: Сетка

source: To create mesh we need boolean operations that are available in ``occ`` factory.
fr: Pour créer un maillage, nous avons besoin d'opérations booléennes disponibles dans l'usine ``occ``.
ru: Для создания сетки нам нужны булевы операции, доступные в фабрике occ.

source: It's recommended to disable ``items_do_structure_map`` and ``items_do_quadrate_map`` fields, i.e. to create unstructured tetrahedral mesh while using boolean operations to achieve better stability of mesh generation.
fr: Il est recommandé de désactiver les champs ``items_do_structure_map`` et ``items_do_quadrate_map``, c'est-à-dire de créer un maillage tétraédrique non structuré tout en utilisant des opérations booléennes pour obtenir une meilleure stabilité de génération du maillage.
ru: Рекомендуется отключать поля ``items_do_structure_map`` и ``items_do_quadrate_map``, т.е. создавать неструктурированную тетраэдральную сетку при использовании булевых операций для достижения большей стабильности генерации сетки.

source: Mesh generated with ``occ`` ``factory``
fr: Maillage généré avec ``occ`` ``factory``
ru: Сетка, созданная с помощью ``occ`` ``factory``

source: One could customize mesh quality using ``run.options`` fields, e.g:
fr: On pourrait personnaliser la qualité du maillage en utilisant les champs ``run.options``, par exemple:
ru: Можно настроить качество сетки, используя поля ``run.options``, например:

source: ``Mesh.MeshSizeFactor`` - factor applied to all mesh element sizes,
fr: ``Mesh.MeshSizeFactor`` - facteur appliqué à toutes les tailles d'éléments de maillage,
ru: ``Mesh.MeshSizeFactor`` - коэффициент, применяемый ко всем размерам элементов сетки,

source: ``Mesh.MeshSizeMin`` - minimum mesh element size,
fr: ``Mesh.MeshSizeMin`` - taille minimale de l'élément de maillage,
ru: ``Mesh.MeshSizeMin`` - минимальный размер элемента сетки,

source: ``Mesh.MeshSizeMax`` - maximum mesh element size,
fr: ``Mesh.MeshSizeMax`` - taille maximale de l'élément de maillage,
ru: ``Mesh.MeshSizeMax`` - максимальный размер элемента сетки,

source: ``Mesh.MeshSizeExtendFromBoundary`` - extend computation of mesh element sizes from the boundaries into the interior (``0``: never; ``1``: for surfaces and volumes; ``2``: for surfaces and volumes, but use smallest surface element edge length instead of longest length in 3D Delaunay; ``-2``: only for surfaces; ``-3``: only for volumes),
fr: ``Mesh.MeshSizeExtendFromBoundary`` - étend le calcul de la taille des éléments de maillage des frontières vers l'intérieur (``0``: jamais; ``1``: pour les surfaces et les volumes; ``2``: pour les surfaces et les volumes, mais utiliser la plus petite longueur d'arête d'élément de surface au lieu de la plus grande longueur en 3D Delaunay; ``-2`` : uniquement pour les surfaces; ``-3``: uniquement pour les volumes)
ru: ``Mesh.MeshSizeExtendFromBoundary`` - расширение вычисления размеров элементов сетки от границ во внутреннюю часть (``0``: никогда; ``1``: для поверхностей и объемов; ``2``: для поверхностей и объемов. , но использовать наименьшую длину ребра элемента поверхности вместо наибольшей длины в 3D Делоне; ``-2``: только для поверхностей; ``-3``: только для объемов),

source: ``Mesh.MeshSizeFromCurvature`` - automatically compute mesh element sizes from curvature, using the value as the target number of elements per 2 * Pi radians.
fr: ``Mesh.MeshSizeFromCurvature`` - calcule automatiquement la taille des éléments de maillage à partir de la courbure, en utilisant la valeur comme nombre cible d'éléments par 2 * Pi radians.
ru: ``Mesh.MeshSizeFromCurvature`` - автоматически вычисляет размеры элементов сетки по кривизне, используя значение в качестве целевого количества элементов на 2 * Pi радиан.

source: See `documentation <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_ of gmsh for more information about options and their description.
fr: Voir la `documentation <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_ de gmsh pour plus d'informations sur les options et leur description.
ru: См. `документацию <https://gmsh.info/doc/texinfo/gmsh.html#Mesh-options>`_ gmsh для получения дополнительной информации об опциях и их описании.

source: Mesh configured with ``metadata.run.options``
fr: Maillage configuré avec ``metadata.run.options``
ru: Сетка настроена с помощью ``metadata.run.options``
