Repository: romanzes637/gmsh_scripts
Catalog: docs/locale/*/LC_MESSAGES/tutorial_section_2.po
Languages: fr, ru

source: One could disable structured mesh generation by setting ``items_do_structure_map`` to ``0`` (``1`` by default) in the ``data`` field:
fr: On pourrait désactiver la génération de maillage structuré en mettant ``items_do_structure_map`` à ``0`` (``1`` par défaut) dans le champ ``data``:
ru: Можно отключить генерацию структурированной сетки, установив ``items_do_structure_map`` в ``0`` (``1`` по умолчанию) в ``data`` поле:

source: Unstructured tetrahedral mesh of the ``BOTTOM`` block with ``items_do_structure_map`` = ``0``
fr: Maillage tétraédrique non structuré du bloc ``BOTTOM`` avec ``items_do_structure_map`` = ``0``
ru: Неструктурированная тетраэдральная сетка блока ``BOTTOM`` с ``items_do_structure_map`` = ``0``

source: To create structured tetrahedral mesh with all blocks one should set third parameter in each of the blocks and run ``main.yaml``
fr: Pour créer un maillage tétraédrique structuré avec tous les blocs, il faut définir le troisième paramètre dans chacun des blocs et exécuter ``main.yaml``
ru: Для создания структурированной тетраэдральной сетки со всеми блоками необходимо установить третий параметр в каждом из блоков и запустить ``main.yaml``

source: Number of nodes MUST be consistent between adjacent blocks, e.g. all ``TOP`` blocks should have the same number of nodes by Y and Z axis
fr: Le nombre de nœuds DOIT être cohérent entre les blocs adjacents, par exemple, tous les blocs ``TOP`` doivent avoir le même nombre de nœuds par axe Y et Z
ru: ``TOP`` блоки должны иметь одинаковое количество узлов по оси Y и Z

source: Structured tetrahedral mesh
fr: Maillage tétraédrique structuré
ru: Структурированная тетраэдральная сетка

source: To disable generation of structured mesh for all blocks at once one should set ``children_items_do_structure_map`` = ``[0, ..., number of children]`` at parent block, e.g. for ``main.yaml``:
fr: Pour désactiver la génération de maillage structuré pour tous les blocs à la fois, il faut définir ``children_items_do_structure_map`` = ``[0, ..., nombre d'enfants]`` au niveau du bloc parent, par exemple pour ``main.yaml``:
ru: Отключить генерацию структурированной сетки сразу для всех блоков можноустановив ``children_items_do_structure_map`` = ``[0, ..., количество дети]`` в родительском блоке, например, для ``main.yaml``:

source: Structured tetrahedral mesh with disabled ``children_items_do_structure_map``
fr: Maillage tétraédrique structuré avec ``children_items_do_structure_map`` désactivé
ru: Структурированная тетраэдральная сетка с отключенными``children_items_do_structure_map``

source: Structured Hexahedral
fr: Hexaèdre structuré
ru: Структурированная гексаэдральная

source: For creating structured hexahedral mesh one could do the same steps as for `Structured Tetrahedral`_ but with ``items_do_quadrate_map`` = ``1`` (``0`` by default) in the ``data`` field:
fr: Pour créer un maillage hexaédrique structuré, on peut suivre les mêmes étapes que pour `Tétraédrique Structuré`_ mais avec ``items_do_quadrate_map`` = ``1`` (``0`` par défaut) dans le champ ``data``:
ru: Для создания структурированной гексаэдральной сетки можно выполнить те же шаги, что и для `Структурированная тетраэдральная`_, но с ``items_do_quadrate_map`` = ``1``(``0`` по умолчанию) в поле ``data``:

source: Structured hexahedral mesh of the ``BOTTOM`` block
fr: Maillage hexaédrique structuré du bloc ``BOTTOM``
ru: Структурированная гексаэдральная сетка блока ``BOTTOM``

source: One could change positions of nodes along axes using one of the two methods:
fr: On pourrait changer les positions des nœuds le long des axes en utilisant l'une des deux méthodes:
ru: Можно изменить положение узлов вдоль осей, используя один из двух методов:

source: ``progression`` - increase/decrease space between nodes from start point to end point
fr: ``progression`` - augmenter/diminuer l'espace entre les nœuds du point de départ au point final
ru: ``progression`` - увеличение/уменьшение расстояния между узлами от начальной точкидо конечной точки

source: ``bump`` - increase/decrease space between node from center to points
fr: ``bump`` - augmenter/diminuer l'espace entre les nœuds du centre aux points
ru: ``bump`` - увеличить/уменьшить расстояние между узлами от центра до точек

source: To use ``progression`` we should specify 2 additional sub-parameters to the third parameter separated by ``:``:
fr: Pour utiliser ``progression``, nous devons spécifier 2 sous-paramètres supplémentaires au troisième paramètre séparés par ``:``:
ru: Чтобы использовать ``progression``, мы должны указать 2 дополнительных подпараметра для третий параметр, разделенный ``:``:

source: The first one is ``0`` (which choose ``progression`` type)
fr: Le premier est ``0`` (qui choisit le type ``progression``)
ru: Первый - ``0`` (который выбирает тип ``progression``)

source: The second is a coefficient of the ``progression`` - if coefficient > 1 space will be increasing from first point to second else decreasing
fr: Le second est un coefficient de la ``progression`` - si le coefficient > 1 l'espace augmentera du premier point au second, sinon il diminuera
ru: Второй - это коэффициент ``progression`` - если коэффициент > 1расстояние будет увеличиваться от первой точки ко второй, иначе уменьшаться

source: For example, ``progression`` sub-parameters ``0:1.5`` for Y-axis:
fr: Par exemple, les sous-paramètres ``progression`` ``0:1.5`` pour l'axe Y:
ru: Например, подпараметры ``progression`` ``0:1.5`` для оси Y:

source: Structured hexahedral mesh with ``progression`` = `1.5`
fr: Maillage hexaédrique structuré avec ``progression`` = `1.5`
ru: Структурированная гексаэдральная сетка с ``progression`` = `1.5`

source: For example, ``progression`` sub-parameters ``0:0.75`` for Y-axis:
fr: Par exemple, les sous-paramètres ``progression`` ``0:0.75`` pour l'axe Y:
ru: Например, подпараметры ``progression`` ``0:0.75`` для оси Y:

source: Structured hexahedral mesh with ``progression`` = `0.75`
fr: Maillage hexaédrique structuré avec ``progression`` = `0.75`
ru: Структурированная гексаэдральная сетка с ``progression`` = `0.75`

source: To use ``bump`` we should specify 2 additional sub-parameters to the third parameter separated by ``:``:
fr: Pour utiliser ``bump``, nous devons spécifier 2 sous-paramètres supplémentaires au troisième paramètre séparés par ``:``:
ru: Чтобы использовать ``bump``, мы должны указать 2 дополнительных подпараметра в третий параметр, разделенный ``:``:

source: The first one is ``1`` (which choose ``bump`` type)
fr: Le premier est ``1`` (qui choisit le type ``bump``)
ru: Первый - ``1`` (который выбирает тип ``bump``)

source: The second is a coefficient of the ``bump`` - if coefficient > 1 space will be increasing from the center else decreasing
fr: Le second est un coefficient de la ``bump`` - si le coefficient > 1, l'espace augmentera à partir du centre, sinon il diminuera
ru: Вторым является коэффициент ``bump`` - если коэффициент > 1 расстояние будет увеличиваться от центра, иначе уменьшаться

source: For example, ``bump`` sub-parameters ``1:2.0`` for Y-axis:
fr: Par exemple, les sous-paramètres ``bump`` ``1:2.0`` pour l'axe Y:
ru: Например, подпараметры ``bump`` ``1:2.0`` для оси Y:

source: Structured hexahedral mesh with ``bump`` = `2.0`
fr: Maillage hexaédrique structuré avec ``bump`` = `2.0`
ru: Структурированная гексаэдральная сетка с ``bump`` = `2.0`

source: For example, ``bump`` sub-parameters ``1:0.5`` for Y-axis:
fr: Par exemple, les sous-paramètres ``bump`` ``1:0.5`` pour l'axe Y:
ru: Например, подпараметры ``bump`` ``1:0.5`` для оси Y:

source: Structured hexahedral mesh with ``bump`` = `0.5`
fr: Maillage hexaédrique structuré avec ``bump`` = `0.5`
ru: Структурированная гексаэдральная сетка с ``bump`` = `0.5`

source: To generate structured hexahedral mesh of all blocks one could set ``items_do_quadrate_map`` = ``0`` at each of the blocks or set ``children_items_do_quadrate_map`` = ``[0, ..., number of children]`` at parent block, e.g. for ``main.yaml``:
fr: Pour générer un maillage hexaédrique structuré de tous les blocs, on peut définir ``items_do_quadrate_map`` = ``0`` à chacun des blocs ou définir ``children_items_do_quadrate_map`` = ``[0, ..., nombre d'enfants]`` au bloc parent, par ex. pour ``main.yaml``:
ru: Для создания структурированной гексаэдральной сетки всех блоков можно установить ``items_do_quadrate_map`` = ``0`` в каждом из блоков или установить ``children_items_do_quadrate_map`` = ``[0, ..., количество детей]`` в родительском блоке, например, для ``main.yaml``:

source: Structured hexahedral mesh
fr: Maillage hexaédrique structuré
ru: Структурированная гексаэдральная сетка

source: Zones
ru: Зоны

source: If we want to add names to entities of the mesh (e.g. volumes of surfaces) we should set additional field ``items_zones`` in the ``data`` field
fr: Si nous voulons ajouter des noms aux entités du maillage (par exemple, des volumes de surfaces), nous devons définir un champ supplémentaire ``items_zones`` dans le champ ``data``
ru: Если мы хотим добавить имена объектам сетки (например, объемам или поверхностям) мы должны установить дополнительное поле ``items_zones`` в поле ``data``

source: For example, we can add ``[ [ Volume, [ NX, X, NY, Y, NZ, Z ] ] ]`` in the``bottom.yaml``, where:
fr: Par exemple, nous pouvons ajouter ``[ [ Volume, [ NX, X, NY, Y, NZ, Z ] ] ]`` dans le ``bottom.yaml``, où:
ru: Например, мы можем добавить ``[ [ Volume, [ NX, X, NY, Y, NZ, Z ] ] ]`` в файл ``bottom.yaml``, где:

source: ``Volume`` - volume name
fr: ``Volume`` - nom du volume
ru: ``Volume`` - имя объема

source: ``[ NX, X, NY, Y, NZ, Z ]`` - surfaces names:
fr: ``[ NX, X, NY, Y, NZ, Z ]`` - noms des surfaces:
ru: ``[ NX, X, NY, Y, NZ, Z ]`` - имена поверхностей:

source: ``NX`` - surface pointing in the opposite direction of X-axis
fr: ``NX`` - surface pointant dans la direction opposée à l'axe X
ru: ``NX`` - поверхность, направленная в направлении, противоположном оси X

source: ``X`` - surface pointing in the direction of X-axis
fr: ``X`` - surface pointant dans la direction de l'axe X
ru: ``X`` - поверхность, направленная в направлении оси X

source: ``NY`` - surface pointing in the opposite direction of Y-axis
fr: ``NY`` - surface pointant dans la direction opposée à l'axe Y
ru: ``NY`` - поверхность, направленная в направлении, противоположном оси Y

source: ``Y`` - surface pointing in the direction of Y-axis
fr: ``Y`` - surface pointant dans la direction de l'axe Y
ru: ``Y`` - поверхность, направленная в направлении оси Y

source: ``NZ`` - surface pointing in the opposite direction of Z-axis
fr: ``NZ`` - surface pointant dans la direction opposée à l'axe Z
ru: ``NZ`` - поверхность, направленная в направлении, противоположном оси Z

source: ``Z`` - surface pointing in the direction of Z-axis
fr: ``Z`` - surface pointant dans la direction de l'axe Z
ru: ``Z`` - поверхность, направленная в направлении оси Z

source: Structured hexahedral with zones
fr: Hexaèdre structuré avec zones
ru: Структурированная гексаэдральная сетка с зонами

source: Result
fr: Résultat
ru: Результат

source: We should define different zone names of bottom surfaces of ``TOP2`` and ``TOP3``, e.g. ``Top2NZ`` and ``Top3NZ`` respectively
fr: Nous devrions définir différents noms de zone des surfaces inférieures de ``TOP2`` et ``TOP3``, par ex. ``Top2NZ`` et ``Top3NZ`` respectivement
ru: Мы должны назначить разные имена для нижних зон поверхностей ``TOP2`` и ``TOP3``, например, ``Top2NZ`` и ``Top3NZ`` соответственно

source: File ``metadata`` has ``run`` sub-field with fields:
fr: Le fichier ``metadata`` a un sous-champ ``run`` avec des champs:

source: First type of parameters aka ``point parameters`` is set in ``matrix`` field (e.g. ``bottom.yaml``):
fr: Le premier type de paramètres alias ``point parameters`` est défini dans le champ ``matrix`` (par exemple, ``bottom.yaml``):

source: To generate all blocks, one needs to specify point parameters at all blocks and run generator:
fr: Pour générer tous les blocs, il faut spécifier des paramètres de point à tous les blocs et exécuter le générateur:
